tuankiet65/arduino_tht/board/boards.txt
uno.name=Main board (Arduino Uno)
uno.upload.protocol=arduino
uno.upload.maximum_size=32256
uno.upload.speed=115200
uno.bootloader.low_fuses=0xff
uno.bootloader.high_fuses=0xde
uno.bootloader.extended_fuses=0x05
uno.bootloader.path=optiboot
uno.bootloader.file=optiboot_atmega328.hex
uno.bootloader.unlock_bits=0x3F
uno.bootloader.lock_bits=0x0F
uno.build.mcu=atmega328p
uno.build.f_cpu=16000000L
uno.build.core=arduino
uno.build.variant=standard

###################################################

atmega8min.name=Sub1/2/3/4 board (ATmega8min)
atmega8min.upload.protocol=arduino
atmega8min.upload.maximum_size=7680
atmega8min.upload.speed=38400
atmega8min.bootloader.low_fuses=0x84
atmega8min.bootloader.high_fuses=0xd4
atmega8min.bootloader.path=optiboot
atmega8min.bootloader.file=optiboot_atmega8_8mhz.hex
atmega8min.bootloader.unlock_bits=0x3F
atmega8min.bootloader.lock_bits=0x0F
atmega8min.build.mcu=atmega8
atmega8min.build.f_cpu=8000000L
atmega8min.build.core=arduino
atmega8min.build.variant=standard
